InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>МетодыРаспределенияКосвенныхРасходовОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРаспределенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетодыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатратБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатратНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МетодыРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>МетодыРаспределенияКосвенныхРасходов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АналитикаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗакрытияБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗакрытияНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурноеПодразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоддержкаРаботыСоСтруктурнымиПодразделениями = ПолучитьФункциональнуюОпцию("ПоддержкаРаботыСоСтруктурнымиПодразделениями");
	ЗаполнитьТЧМетодыРаспределения();
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Если НЕ Справочники.Организации.ИспользуетсяНесколькоОрганизаций() Тогда
			Запись.СтруктурноеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
		// Включим предопределенные счета и их субсчета
	УчетПроизводства.ОграничитьВыборСчетамиНакладныхРасходов(Элементы.СчетЗатратБУ);
	УчетПроизводства.ОграничитьВыборСчетамиНакладныхРасходов(Элементы.СчетЗатратНУ, "Налоговый");
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//Если ЗначениеЗаполнено(Запись.Организация)
	//	И НЕ ЗначениеЗаполнено(Запись.СтруктурноеПодразделение) Тогда
	//	
	//	Запись.СтруктурноеПодразделение = Запись.Организация;
	//	
	//Иначе
		
	Если Запись.СтруктурноеПодразделение = Неопределено Тогда
		
		Запись.СтруктурноеПодразделение =  ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МетодРаспределенияЗатратПриИзменении(Элемент)
	
	ЗаполнитьТЧМетодыРаспределения();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗатратБУПриИзменении(Элемент)
	
	Запись.СчетЗатратНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Запись.СчетЗатратБУ));	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Запись   = Форма.Запись;
	Элементы = Форма.Элементы;
	
	// Отображение колонки СтруктурноеПодразделение
	Если Форма.ПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда 
		Элементы.МетодыРаспределенияСтруктурноеПодразделение.Видимость = Истина;
	Иначе 
		Элементы.МетодыРаспределенияСтруктурноеПодразделение.Видимость = Форма.ОтображениеКолонкиСтруктурноеПодразделение;
	КонецЕсли;

	ОтображениеПанелиСтруктурноеПодразделение = Ложь;

	Если ТипЗнч(Запись.СтруктурноеПодразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ОтображениеПанелиСтруктурноеПодразделение = Истина;
	КонецЕсли; 

	Если НЕ Форма.ПоддержкаРаботыСоСтруктурнымиПодразделениями И НЕ ОтображениеПанелиСтруктурноеПодразделение Тогда
		Элементы.СтруктурноеПодразделение.Видимость = Ложь;
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧМетодыРаспределения()
	
	МетодыРаспределения.Очистить();
	Элементы.МетодыРаспределенияПроцентРаспределения.Видимость = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.Ссылка,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.НомерСтроки,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СтруктурноеПодразделение,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СчетЗакрытияБУ,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоБУ1,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоБУ2,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоБУ3,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СчетЗакрытияНУ,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоНУ1,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоНУ2,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.СубконтоНУ3,
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.ПроцентРаспределения
		|ИЗ
		|	Справочник.МетодыРаспределенияКосвенныхРасходов.АналитикаРаспределения КАК МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения
		|ГДЕ
		|	МетодыРаспределенияКосвенныхРасходовАналитикаРаспределения.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Запись.МетодРаспределенияЗатрат);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Строка = МетодыРаспределения.Добавить();
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентРаспределения) Тогда 
			Элементы.МетодыРаспределенияПроцентРаспределения.Видимость = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.СтруктурноеПодразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			ОтображениеКолонкиСтруктурноеПодразделение = Истина;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Строка, ВыборкаДетальныеЗаписи);
				
	КонецЦикла;
		
КонецПроцедуры
